#ifndef __SERIALIZER_H__
#define __SERIALIZER_H__

#include <stdint.h>

#include <vector>
#include <string>
#include <sstream>

#define UNREF(x)   (void)(x)


namespace hid {

    // Reader and Writer must be synchronized with the length of variables
    // Assume we're on the 64 bit CPU architecture.
    static_assert ( sizeof(uint8_t)     == 1, "Wrong size of uint8_t" );
    static_assert ( sizeof(uint16_t)    == 2, "Wrong size of uint16_t" );
    static_assert ( sizeof(uint32_t)    == 4, "Wrong size of uint32_t" );
    static_assert ( sizeof(uint64_t)    == 8, "Wrong size of uint64_t" );
    static_assert ( sizeof(int)         == 4, "Wrong size of int" );
    static_assert ( sizeof(long)        == 4, "Wrong size of long" );
    static_assert ( sizeof(long long)   == 8, "Wrong size of long long" );
    static_assert ( sizeof(size_t)      == 8, "Wrong size of size_t" );
    static_assert ( sizeof(float)       == 4, "Wrong size of float" );
    static_assert ( sizeof(double)      == 8, "Wrong size of double" );

    typedef std::string             serializer_string_t;
    typedef std::vector<uint8_t>    serializer_bin_t;
    typedef std::vector<uint8_t>    serializer_storage_t;

    enum class serializer_state_t {
        SERIALIZER_STATE_UNKNOWN,
        SERIALIZER_STATE_OK,
        SERIALIZER_STATE_FAILED
    };

    enum class serializer_len_t: uint32_t {
        SERIALIZER_LEN_ZERO
    };

    enum class serializer_type_t : uint8_t {

        SERIALIZER_TYPE_UNDEFINED           = 0,

        SERIALIZER_TYPE_INT8                = 0x11,
        SERIALIZER_TYPE_UINT8               = 0x12,
        SERIALIZER_TYPE_INT16               = 0x13,
        SERIALIZER_TYPE_UINT16              = 0x14,
        SERIALIZER_TYPE_INT32               = 0x15,
        SERIALIZER_TYPE_UINT32              = 0x16,
        SERIALIZER_TYPE_INT64               = 0x17,
        SERIALIZER_TYPE_UINT64              = 0x18,
